<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during authentication for various
    | messages that we need to display to the user. You are free to modify
    | these language lines according to your application's requirements.
    |
    */

    'failed' => 'ไม่พบข้อมูลผู้ใช้งานในระบบ',
    'throttle' => 'ตรวจพบความพยายามเข้าระบบมากเกินไป กรุณาลองอีกครั้งใน :seconds วินาที.',

    'bedo' => [
        'failed' => 'Username & Password is incorrect.',
    ],

    'login' => [
        'label' => 'เข้าสู่ระบบ',
        'label_org' => 'เข้าสู่ระบบ องค์กร:name',
        'welcome_back' => 'ยินดีต้อนรับ',
        'inactive' => 'บัญชีผู้ใช้งานของคุณถูกระงับ. โปรดติดต่อผู้ดูแลระบบของคุณเพื่อขอความช่วยเหลือเกี่ยวกับข้อผิดพลาดนี้',
        'verify' => 'Your account was not verified. Please look for the verification email in your inbox and click the link in that email.',
        'verify_by_admin' => 'บัญชีผู้ใช้งาน ของคุณยังไม่ได้รับการอนุมัติจากผู้ดูแลระบบ',
        'accessible' => 'บัญชีผู้ใช้งานของคุณ สามารถเข้าใช้งานได้ในวันที่ :date.',
        'expired' => 'บัญชีผู้ใช้งานของคุณหมดอายุ โปรดติดต่อผู้ดูแลระบบของคุณเพื่อขอความช่วยเหลือเกี่ยวกับข้อผิดพลาดนี้',
        'duplicate' => 'ตรวจพบชื่อผู้ใช้งาน ซ้ำในระบบ',
        'choose_org' => 'กรุณาระบุองค์กรที่คุณต้องการ Login เข้าใช้งาน',
        'sign_in' => 'เข้าสู่ระบบด้วยบัญชีผู้ใช้งาน',
        'username' => 'ชื่อผู้ใช้งาน',
        'password' => 'รหัสผ่าน',
        'remember_me' => 'จำฉันไว้ในระบบ',
        'forgot_password' => 'ลืมรหัสผ่าน',
        'btn_sign_in' => 'เข้าสู่ระบบ',
        'btn_submit' => 'ยืนยัน',
        'dont_have_account' => 'กรณีไม่มีบัญชีผู้ใช้งาน',
        'register' => 'สมัครสมาชิก',
        'password_incorrect' => 'รหัสผ่านไม่ถูกต้อง กรุณาลองใหม่อีกครั้ง',
        'user_not_found_from_project' => 'คุณยังไม่ได้เป็นสมาชิก :project สมัครสมาชิกเลย',
        'user_not_found' => 'ไม่พบชื่อผู้ใช้งาน กรุณาลองใหม่อีกครั้ง',
        'user_org_not_found' => 'ไม่พบชื่อผู้ใช้งานในองค์กร กรุณาลองใหม่อีกครั้ง',
        'user_org_duplicate' => 'พบชื่อผู้ใช้งานซ้ำในองค์กร กรุณาลองใหม่อีกครั้ง/ติดต่อผู้ดูแลระบบของคุณเพื่อขอความช่วยเหลือเกี่ยวกับข้อผิดพลาดนี้',
        'user_duplicate' => 'คุณเป็นสมาชิก :project ทั้งหมด :total ห้องสมุด',
        'org_not_found' => 'ไม่พบข้อมูลองค์กร กรุณาลองใหม่อีกครั้ง',
        'org_inactive' => 'องค์กรของคุณถูกระงับ โปรดติดต่อผู้ดูแลระบบของคุณเพื่อขอความช่วยเหลือเกี่ยวกับข้อผิดพลาดนี้',
        'org_expired' => 'องค์กรของคุณหมดอายุ โปรดติดต่อผู้ดูแลระบบของคุณเพื่อขอความช่วยเหลือเกี่ยวกับข้อผิดพลาดนี้.',
    ],

    'verify' => [
        'email' => 'E-mail not found.',
        'token' => 'Your activation code is incorrect. Please check link from your email again.',
        'success' => 'Your activation is complete.',
        'limit_user' => 'สมาชิกถึงขีดจำกัดแล้ว โปรดติดต่อผู้ดูแลระบบของคุณเพื่อขอความช่วยเหลือเกี่ยวกับข้อผิดพลาดนี้.',
    ],

    'register' => [
        'register' => 'ลงทะเบียน',
        'ready_explode' => 'Ready to explore the world?',
        'email_address' => 'อีเมล',
        'password' => 'รหัสผ่าน',
        're_enter_password' => 'พิมพ์รหัสผ่านอีกครั้ง',
        'first_name' => 'ชื่อ',
        'last_name' => 'นามสกุล',
        'department' => 'หน่วยงาน',
        'phone' => 'เบอร์ติดต่อ',
        'gender' => 'เพศ',
        'female' => 'หญิง',
        'male' => 'ชาย',
        'unspecified' => 'ไม่ระบุ',
        'btn_sign_up' => 'ลงทะเบียน',
        'sign_in' => 'เข้าสู่ระบบ',
        'continue_account' => 'ด้วยบัญชีผู้ใช้งาน',
        'password_format' => ':number ตัวอักษรและ ประกอบด้วย :character อย่างน้อย 1 ตัวอักษร',
        'password_format_1' => 'รหัสผ่านมีความยาวระหว่าง :number ตัวอักษร',
        'password_format_2' => 'ประกอบด้วย ตัวอักษรพิมพ์เล็ก (a-z) ตัวอักษรพิมพ์ใหญ่ (A-Z) ตัวเลข (0-9) และอักขระพิเศษ (#?!@$%^&*-_) อย่างน้อย 1 ตัว',
        'id_card' => 'หมายเลขบัตรประจำตัวประชาชน / เลขที่หนังสือเดินทาง',
        'occupation' => 'อาชีพ',
        'address_bill' => 'ที่อยู่ (ใช้สำหรับออกใบกำกับภาษี)',
        'position' => 'ตำแหน่ง',
        'line_id' => 'Line ID',
        'facebook_id' => 'Facebook ID',
        'success' => 'คุณได้สมัครสมาชิกเรียบร้อยแล้ว',
        // error message
        'verify_account' => 'กรุณาตรวจสอบ email ของท่านและทำการยืนยันตัวตนหรือ รอการอนุมัติจากผู้ดูแลระบบก่อนเข้าใช้งาน',
        'verify' => ' กรุณาตรวจสอบ email ของท่านและทำการยืนยันตัวตนก่อนเข้าใช้งาน',
        'verify_by_admin' => 'กรุณารอการอนุมัติจากผู้ดูแลระบบก่อนเข้าใช้งาน',
        'duplicate' => 'อีเมลนี้ถูกใช้งานในระบบแล้ว',
        'duplicate' => [
            'msg' => 'ตรวจพบผู้ใช้งานซ้ำในระบบ',
            'email' => 'อีเมลนี้ถูกใช้งานในระบบแล้ว',
            'member_id' => 'รหัสนี้ถูกใช้งานในระบบแล้ว',
        ],
        'org_not_found' => 'ไม่พบข้อมูลองค์กร โปรดติดต่อผู้ดูแลระบบของคุณเพื่อขอความช่วยเหลือเกี่ยวกับข้อผิดพลาดนี้',
        'org_inactive' => 'องค์กรของคุณถูกระงับ โปรดติดต่อผู้ดูแลระบบของคุณเพื่อขอความช่วยเหลือเกี่ยวกับข้อผิดพลาดนี้',
        'org_expired' => 'องค์กรของคุณหมดอายุ โปรดติดต่อผู้ดูแลระบบของคุณเพื่อขอความช่วยเหลือเกี่ยวกับข้อผิดพลาดนี้.',
        'limit_user' => 'สมาชิกถึงขีดจำกัดแล้ว โปรดติดต่อผู้ดูแลระบบของคุณเพื่อขอความช่วยเหลือเกี่ยวกับข้อผิดพลาดนี้.',
    ],

    'reset_password' => [
        'title' => 'Reset Password',
        'description' => 'ระบบจะส่งลิงก์สำหรับรีเซ็ตรหัสผ่านไปยังอีเมลของคุณที่ได้ลงทะเบียนไว้',
        'reset_password' => 'เปลี่ยนรหัสผ่าน',
        'email_address' => 'อีเมล',
        'password' => 'รหัสผ่าน',
        're_enter_password' => 'พิมพ์รหัสผ่านอีกครั้ง',
        'password_format' => ':number ตัวอักษรและ ประกอบด้วย :character อย่างน้อย 1 ตัวอักษร',
        'password_format_1' => 'รหัสผ่านมีความยาวระหว่าง :number ตัวอักษร',
        'password_format_2' => 'ประกอบด้วย ตัวอักษรพิมพ์เล็ก (a-z) ตัวอักษรพิมพ์ใหญ่ (A-Z) ตัวเลข (0-9) และอักขระพิเศษ (#?!@$%^&*-_) อย่างน้อย 1 ตัว',
        'send_password' => 'ส่งรหัสผ่านตามลิงก์',
        'already_remember' => 'หากจำรหัสผ่านได้',
        'sign_in_here' => 'เข้าสู่ระบบที่นี่',
        'btn_submit' => 'รีเซ็ตรหัสผ่าน',
        //
        'inactive' => 'บัญชีผู้ใช้งานของคุณถูกระงับ. โปรดติดต่อผู้ดูแลระบบของคุณเพื่อขอความช่วยเหลือเกี่ยวกับข้อผิดพลาดนี้',
        'expired' => 'บัญชีผู้ใช้งานของคุณหมดอายุ โปรดติดต่อผู้ดูแลระบบของคุณเพื่อขอความช่วยเหลือเกี่ยวกับข้อผิดพลาดนี้',
        'duplicate' => 'ตรวจพบชื่อผู้ใช้งาน ซ้ำในระบบ',
        'choose_org' => 'กรุณาระบุองค์กรที่คุณต้องการ กำหนดรหัสผ่านใหม่',
        'user_not_found_from_project' => 'คุณยังไม่ได้เป็นสมาชิก :project สมัครสมาชิกเลย',
        'user_not_found' => 'ไม่พบชื่อผู้ใช้งาน กรุณาลองใหม่อีกครั้ง',
        'user_org_not_found' => 'ไม่พบชื่อผู้ใช้งานในองค์กร กรุณาลองใหม่อีกครั้ง',
        'user_org_duplicate' => 'พบชื่อผู้ใช้งานซ้ำในองค์กร กรุณาลองใหม่อีกครั้ง/ติดต่อผู้ดูแลระบบของคุณเพื่อขอความช่วยเหลือเกี่ยวกับข้อผิดพลาดนี้',
        'org_not_found' => 'ไม่พบข้อมูลองค์กร กรุณาลองใหม่อีกครั้ง',
        'org_inactive' => 'องค์กรของคุณถูกระงับ โปรดติดต่อผู้ดูแลระบบของคุณเพื่อขอความช่วยเหลือเกี่ยวกับข้อผิดพลาดนี้',
        'org_expired' => 'องค์กรของคุณหมดอายุ โปรดติดต่อผู้ดูแลระบบของคุณเพื่อขอความช่วยเหลือเกี่ยวกับข้อผิดพลาดนี้.',
    ]

];
